test-app/artillery/auth-static.yml
config:
  target: "http://localhost:{{ $processEnvironment.SERVER_PORT }}"
  phases:
    - duration: 1
      arrivalRate: 1
  engines:
    socketio-v3: {}
  processor: "../functions.js"
scenarios:
  - name: Authentication via Auth
    engine: socketio-v3
    flow:
      - connect:
          auth:
            token: "all-access-token"
        namespace: /secured-md
      - emit: [ "ping" ]
        namespace: /secured-md
        acknowledge:
          args: true